{"text": "A problem was found with capital gains tax treatment on crypto transactions.", "label": 0}
{"text": "This memo discusses the topic of withholding tax exemptions under EU directives.", "label": 2}
{"text": "The document reviews the topic of thin capitalization rules and interest caps.", "label": 2}
{"text": "This document discusses the topic of the Dutch participation exemption regime.", "label": 2}
{"text": "The memorandum cites tax computations for year 2024.", "label": 3}
{"text": "This note outlines the topic of VAT treatment for digital services.", "label": 2}
{"text": "This memorandum explores the topic of foreign branch exemption mechanics.", "label": 2}
{"text": "This document analyzes the topic of beneficial ownership in tax treaties.", "label": 2}
{"text": "This solution details implementing advance pricing agreements to mitigate risk.", "label": 1}
{"text": "This document describes a tax problem related to asset revaluation rules.", "label": 0}
{"text": "The memo covers CIT adjustments applicable for tax year 2022.", "label": 3}
{"text": "The analysis discusses deferred tax asset recognition as of year 2020.", "label": 3}
{"text": "The client encountered a problem with the limitation on interest deductibility.", "label": 0}
{"text": "The solution involves segregating passive income streams under CFC rules.", "label": 1}
{"text": "A compliance problem occurred with the late submission of transfer pricing files.", "label": 0}
{"text": "A solution was developed to restructure the entity to satisfy participation exemption.", "label": 1}
{"text": "There is a tax problem involving depreciation limits under Dutch law.", "label": 0}
{"text": "The memorandum describes regulatory updates for year 2025.", "label": 3}
{"text": "This report identifies a tax problem related to foreign exchange losses.", "label": 0}
{"text": "A phased implementation plan was designed to resolve cross-border audit issues.", "label": 1}
{"text": "The summary includes reconciliations for tax year 2023.", "label": 3}
{"text": "This memo relates to the tax year 2019 for retrospective audit adjustments.", "label": 3}
{"text": "This letter discusses reporting positions taken in year 2022.", "label": 3}
{"text": "The report summarizes CIT assessments for year 2021.", "label": 3}
{"text": "The memo elaborates on the tax topic of Article 13 CITA and its motive test.", "label": 2}
{"text": "This note clarifies depreciation limits effective in year 2023.", "label": 3}
{"text": "The document discusses the topic of dividend stripping and anti-abuse rules.", "label": 2}
{"text": "This memo covers the topic of crypto asset taxation in the Netherlands.", "label": 2}
{"text": "The ruling applies to the fiscal year 2020 and subsequent years.", "label": 3}
{"text": "This document compares tax base computations for years 2021–2023.", "label": 3}
{"text": "A remediation plan was implemented to correct late filing penalties.", "label": 1}
{"text": "We developed a process to automate ETR reporting to avoid threshold breaches.", "label": 1}
{"text": "A problem is identified in tax treatment of share-based compensation.", "label": 0}
{"text": "This study covers the topic of deferred tax recognition under IFRS.", "label": 2}
{"text": "The memo provides a step-plan to solve VAT mismatch in chain transactions.", "label": 1}
{"text": "A problem exists in determining tax residency for a dual-listed entity.", "label": 0}
{"text": "Our solution involves implementing a quarterly ETR monitoring process.", "label": 1}
{"text": "This report outlines the topic of the OECD’s Pillar Two implementation framework.", "label": 2}
{"text": "This report reviews losses carried forward into year 2025.", "label": 3}
{"text": "We proposed establishing a permanent establishment risk register.", "label": 1}
{"text": "The report presents the topic of fiscal unity under Dutch corporate tax law.", "label": 2}
{"text": "This study investigates the topic of transfer of losses during mergers.", "label": 2}
{"text": "This case deals with a tax problem regarding bad debt deductions.", "label": 0}
{"text": "The document elaborates on the topic of controlled foreign company exemptions.", "label": 2}
{"text": "This memo details the topic of tax residency determination for holding companies.", "label": 2}
{"text": "This document outlines a tax problem involving the deduction of employee expenses.", "label": 0}
{"text": "We recommend adopting a ruling to confirm transfer pricing consistency.", "label": 1}
{"text": "This document provides a tax solution for aligning intercompany pricing policies.", "label": 1}
{"text": "This paper summarizes the topic of CFC legislation and substance tests.", "label": 2}
{"text": "The memorandum applies to the financial year ending 2023.", "label": 3}
{"text": "The issue concerns a corporate income tax problem related to loss carryforwards.", "label": 0}
{"text": "This solution applies arm’s-length compensation for intra-group loans.", "label": 1}
{"text": "The memo discusses a VAT compliance problem in cross-border digital services.", "label": 0}
{"text": "This report covers the topic of transfer pricing documentation requirements.", "label": 2}
{"text": "A VAT refund problem was discovered for input tax on mixed-use assets.", "label": 0}
{"text": "We suggest using cost-plus methodology as the optimal tax solution.", "label": 1}
{"text": "A solution includes ring-fencing crypto activities under operational income.", "label": 1}
{"text": "This report refers to fiscal year 2020 as the base period.", "label": 3}
{"text": "This document includes data from the fiscal year 2021/22.", "label": 3}
{"text": "This solution aligns the recognition of deferred tax with accounting standards.", "label": 1}
{"text": "This analysis identifies a tax problem in calculating the effective tax rate.", "label": 0}
{"text": "This memorandum describes a tax problem concerning goodwill amortization.", "label": 0}
{"text": "The solution formalizes dividend policy to prevent participation exemption denial.", "label": 1}
{"text": "The analysis evaluates deferred tax reversals during 2022.", "label": 3}
{"text": "This case highlights a payroll tax problem due to incorrect classification of contractors.", "label": 0}
{"text": "The issue involves transfer pricing problems between group subsidiaries.", "label": 0}
{"text": "This document suggests implementing a double tax treaty exemption claim.", "label": 1}
{"text": "This memo details a CIT problem in recognizing deferred tax assets on losses.", "label": 0}
{"text": "The solution proposes applying the safe harbor for low value-adding services.", "label": 1}
{"text": "This memo discusses the topic of environmental tax incentives for green assets.", "label": 2}
{"text": "The example refers to fiscal year 2023/24 filing requirements.", "label": 3}
{"text": "An audit revealed a problem with reporting controlled foreign company income.", "label": 0}
{"text": "A withholding tax problem has been identified in dividend payments to non-residents.", "label": 0}
{"text": "The team implemented a revised tax control framework addressing BEPS 2.0.", "label": 1}
{"text": "This report addresses transitional provisions for year 2024.", "label": 3}
{"text": "This document refers to the tax year 2021 and the related reporting obligations.", "label": 3}
{"text": "The issue relates to an indirect tax problem on intra-EU acquisitions.", "label": 0}
{"text": "The memo focuses on the topic of arm’s-length pricing methodologies.", "label": 2}
{"text": "We advised creating an intercompany license agreement to clarify IP ownership.", "label": 1}
{"text": "The memo proposes a solution to optimize withholding tax treaty relief claims.", "label": 1}
{"text": "The entity faced a problem in applying thin capitalization provisions.", "label": 0}
{"text": "This case study concerns provisions recorded in the year 2022.", "label": 3}
{"text": "Our response provides documentation templates for substance defense.", "label": 1}
{"text": "This paper describes the topic of Article 23 of the Dutch CIT Act.", "label": 2}
{"text": "The solution describes adopting a hybrid mismatch neutralization approach.", "label": 1}
{"text": "We propose a governance solution to document substance and purpose.", "label": 1}
{"text": "This document reports a tax problem with intercompany royalty payments.", "label": 0}
{"text": "This paper details the topic of hybrid mismatch arrangements.", "label": 2}
{"text": "This note summarizes transfer pricing updates for the year 2023.", "label": 3}
{"text": "The analysis explores the topic of asset test and subject-to-tax conditions.", "label": 2}
{"text": "The case concerns a VAT correction applicable to the year 2024.", "label": 3}
{"text": "The note outlines ETR monitoring for the period ending in year 2024.", "label": 3}
{"text": "The guidance was issued in the year 2022 and remains valid thereafter.", "label": 3}
{"text": "The report analyzes the topic of capitalization vs. expensing for R&D costs.", "label": 2}
{"text": "Our tax solution reduces exposure by reallocating functions between entities.", "label": 1}
{"text": "This report explains the topic of loss carryforward limitations in corporate taxation.", "label": 2}
{"text": "The tax position was determined for the year ending December 2023.", "label": 3}
{"text": "The taxpayer faces a problem in applying participation exemption rules.", "label": 0}
{"text": "The document introduces the topic of withholding tax reclaims under double tax treaties.", "label": 2}
{"text": "A corporate reorganization created a problem under anti-abuse rules.", "label": 0}
